/*************************************************************************************** 
 *
 * 时间复杂度O(n)，空间复杂度O(1)。
 *
 ***************************************************************************************/

class Solution {
public:
    int climbStairs(int n) {
        if (n == 1) {
            return 1;
        }
        if (n == 2) {
            return 2;
        }
        int ways = 0;
        int n1 = 1;
        int n2 = 2;
        for (int i = 3; i <= n; ++i) {
            ways = n1 + n2;
            n1 = n2;
            n2 = ways;
        }
        return ways;
    }
};

