/*************************************************************************************** 
 *
 * 遍历数组，对固定元素进行计数。
 * 如果当前元素与固定元素相同，则计数加一；
 * 如果当前元素与固定元素不同，则判断计数是否变为0，如果为0则说明固定元素已经删完，否则计数减一。
 * 时间复杂度O(n)，空间复杂度O(1)。
 *
 ***************************************************************************************/

class Solution {
public:
    int majorityElement(vector<int>& nums) {
        int count = 1;
        int value = nums[0];
        for (int i = 1; i < nums.size(); ++i) {
            if (nums[i] == value) {
                ++count;
            } else {
                if (count == 0) {
                    value = nums[i];
                } else {
                    --count;
                }
            }
        }
        return value;
    }
};
