/*************************************************************************************** 
 *
 * x与y求异或后，查看二进制中1的个数。
 * 时间复杂度O(n)，空间复杂度O(1)。
 *
 ***************************************************************************************/

class Solution {
public:
    int hammingDistance(int x, int y) {
        int distance = 0;

        int z = x ^ y;
        while (z > 0) {
            if (z % 2 == 1) {
                ++distance;
            }
            z = z / 2;
        }

        return distance;
    }
};
